# read design 
read_verilog verilog/c3540.v

# elaborate design hierarchy
hierarchy -check -top c3540

# the high-level stuff
proc; opt; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping logic to gates.
abc -g gates,MUX,NMUX

# cleanup
clean -purge

# write synthesized design
write_json circuit.json

# Print statistics
stat

#check output circuit
#show
